Reports/ПрайсЛистПолотна.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПрайсЛистПолотна</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НастройкиПрайсЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиПрайсЛиста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтраницаПрайсЛиста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраницыПрайсЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ПрайсЛистПолотна/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	//Если ЗначениеЗаполнено(ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение) = ложь тогда
	//	Сообщить("Не заполнен период!");
	//	возврат;
	//КонецЕсли;

	////NM
	//ПараметрВалюта = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[6];	
	//Если ПараметрВалюта.Использование И НЕ ЗначениеЗаполнено(ПараметрВалюта.Значение) Тогда
	//	Сообщить("Не заполнена валюта!");
	//	возврат;
	//КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
	тТаблица = ПолучитьТаблицу();
	
	// Компонуем отчет
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ЭтотОбъект.КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, Новый Структура("Т", тТаблица), ДанныеРасшифровки, Истина);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	УстановитьПривилегированныйРежим(ложь);
	
КонецПроцедуры

Функция ПолучитьТаблицу()
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отрез",ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение);
	Запрос.УстановитьПараметр("Потолок",ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[4].Значение);
	Запрос.УстановитьПараметр("ВидЦен",ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2].Значение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныМатериаловСрезПоследних.Фактура.Родитель КАК ФактураРодитель,
	|	ЦеныМатериаловСрезПоследних.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ЦеныМатериаловСрезПоследних.Фактура.ТипФактуры КАК ТипФактуры,
	|	ЦеныМатериаловСрезПоследних.Цена КАК Цена,
	|	ЦеныМатериаловСрезПоследних.Фактура КАК Фактура
	|ПОМЕСТИТЬ ВТ_Отрез
	|ИЗ
	|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|			,
	|			ВидЦен = &ВидЦен
	|				И ВидНоменклатуры В (&Отрез)
	|				И ЦветФактуры <> ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка)) КАК ЦеныМатериаловСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныМатериаловСрезПоследних.Цена,
	|	ЦеныМатериаловСрезПоследних.ВидНоменклатуры,
	|	ЦеныМатериаловСрезПоследних.Фактура.ТипФактуры,
	|	ЦеныМатериаловСрезПоследних.Фактура.Родитель,
	|	ЦеныМатериаловСрезПоследних.Фактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныМатериаловСрезПоследних.Фактура.Родитель КАК ФактураРодитель,
	|	ЦеныМатериаловСрезПоследних.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ЦеныМатериаловСрезПоследних.Фактура.ТипФактуры КАК ТипФактуры,
	|	ЦеныМатериаловСрезПоследних.Цена КАК Цена,
	|	ЦеныМатериаловСрезПоследних.Фактура КАК Фактура
	|ПОМЕСТИТЬ ВТ_Потолок
	|ИЗ
	|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|			,
	|			ВидЦен = &ВидЦен
	|				И ВидНоменклатуры В (&Потолок)
	|				И ЦветФактуры <> ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка)) КАК ЦеныМатериаловСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныМатериаловСрезПоследних.Цена,
	|	ЦеныМатериаловСрезПоследних.ВидНоменклатуры,
	|	ЦеныМатериаловСрезПоследних.Фактура.Родитель,
	|	ЦеныМатериаловСрезПоследних.Фактура.ТипФактуры,
	|	ЦеныМатериаловСрезПоследних.Фактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Потолок.ФактураРодитель, ВТ_Отрез.ФактураРодитель) КАК Фактура,
	|	ЕСТЬNULL(ВТ_Потолок.ТипФактуры, ВТ_Отрез.ТипФактуры) КАК ТипФактуры,
	|	ВТ_Отрез.Цена КАК ЦенаОтрез,
	|	ВТ_Потолок.Цена КАК ЦенаПотолок,
	|	ЕСТЬNULL(ВТ_Отрез.Фактура, ВТ_Потолок.Фактура) КАК Поле1
	|ПОМЕСТИТЬ ВТ_Фактуры
	|ИЗ
	|	ВТ_Отрез КАК ВТ_Отрез
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Потолок КАК ВТ_Потолок
	|		ПО ВТ_Отрез.ФактураРодитель = ВТ_Потолок.ФактураРодитель
	|			И ВТ_Отрез.ТипФактуры = ВТ_Потолок.ТипФактуры
	|			И ВТ_Отрез.Фактура = ВТ_Потолок.Фактура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_Потолок.ТипФактуры, ВТ_Отрез.ТипФактуры),
	|	ЕСТЬNULL(ВТ_Потолок.ФактураРодитель, ВТ_Отрез.ФактураРодитель),
	|	ВТ_Отрез.Цена,
	|	ВТ_Потолок.Цена,
	|	ЕСТЬNULL(ВТ_Отрез.Фактура, ВТ_Потолок.Фактура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Фактуры.Фактура КАК Фактура,
	|	ВТ_Фактуры.ТипФактуры КАК ТипФактуры,
	|	ВТ_Фактуры.ЦенаОтрез КАК ЦенаОтрез,
	|	ВТ_Фактуры.ЦенаПотолок КАК ЦенаПотолок
	|ИЗ
	|	ВТ_Фактуры КАК ВТ_Фактуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(, ВидЦен = &ВидЦен) КАК ЦеныМатериаловСрезПоследних
	|		ПО (ЦеныМатериаловСрезПоследних.Фактура = ВТ_Фактуры.Фактура
	|					И ЦеныМатериаловСрезПоследних.Цена = ВТ_Фактуры.ЦенаОтрез
	|				ИЛИ ЦеныМатериаловСрезПоследних.Цена = ВТ_Фактуры.ЦенаПотолок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Фактуры.ЦенаОтрез,
	|	ВТ_Фактуры.ЦенаПотолок,
	|	ВТ_Фактуры.Фактура,
	|	ВТ_Фактуры.ТипФактуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Фактура,
	|	ЦенаОтрез,
	|	ЦенаПотолок";   				   
 
	Т = Запрос.Выполнить().Выгрузить();
	
	ТЦ = ПолучитьТаблицуЦветовФактур(Т);
	ТШ = ПолучитьТаблицуШиринФактур(Т);
	
	Т.Колонки.Добавить("ШириныФактур"); 
	Т.Колонки.Добавить("ЦветФактуры");
	
	Для каждого Стр Из Т Цикл	
        Стр.ШириныФактур = ПолучитьЗначенияЭлементовСтрокой(ТШ, Стр, "ШиринаПолотна");		
		Стр.ЦветФактуры = ПолучитьЗначенияЭлементовСтрокой(ТЦ, Стр, "ЦветФактуры", 5, "Уточняйте наличие цветов у менеджера");
	КонецЦикла;
	
	Возврат Т;
		
КонецФункции

Функция ПолучитьЗначенияЭлементовСтрокой(ТЗ, СтруктураДляФильтра, ИмяКолонки, КолВоЭлементовБольшое = Неопределено, ФразаЕслиБольшоеКолВоЭлементов="")
	
	ЗначениеЭлемента = "";
	
	НайденныеСтроки = ТЗ.НайтиСтроки(Новый Структура("Фактура, ТипФактуры, ЦенаОтрез, ЦенаПотолок",
	СтруктураДляФильтра.Фактура, СтруктураДляФильтра.ТипФактуры, СтруктураДляФильтра.ЦенаОтрез, СтруктураДляФильтра.ЦенаПотолок));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(КолВоЭлементовБольшое) И НайденныеСтроки.Количество() > КолВоЭлементовБольшое Тогда
			Возврат ФразаЕслиБольшоеКолВоЭлементов;
		КонецЕсли;	   
		МассивЗначений = Новый Массив;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			МассивЗначений.Добавить(НайденнаяСтрока[ИмяКолонки]);
		КонецЦикла;
		ЗначениеЭлемента = СтрСоединить(МассивЗначений, ", ");
	КонецЕсли;
	
	Возврат ЗначениеЭлемента; 
КонецФункции	

Функция ПолучитьТаблицуЦветовФактур(Т)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ.Фактура КАК Фактура,
		|	ВТ.ЦенаОтрез КАК ЦенаОтрез,
		|	ВТ.ЦенаПотолок КАК ЦенаПотолок,
		|	ВТ.ТипФактуры КАК ТипФактуры
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Фактура КАК Фактура,
		|	ВТ.ТипФактуры КАК ТипФактуры,
		|	ЦеныМатериаловСрезПоследних.ЦветФактуры.Наименование КАК ЦветФактуры,
		|	ВТ.ЦенаОтрез КАК ЦенаОтрез,
		|	ВТ.ЦенаПотолок КАК ЦенаПотолок
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
		|				,
		|				Валюта = &Валюта
		|					И ВидЦен = &ВидЦен) КАК ЦеныМатериаловСрезПоследних
		|		ПО (ЦеныМатериаловСрезПоследних.Фактура.Родитель = ВТ.Фактура)
		|			И (ЦеныМатериаловСрезПоследних.Фактура.ТипФактуры = ВТ.ТипФактуры)
		|			И (ВЫБОР
		|				КОГДА ЦеныМатериаловСрезПоследних.ВидНоменклатуры = &Отрез
		|					ТОГДА ЦеныМатериаловСрезПоследних.Цена = ВТ.ЦенаОтрез
		|				ИНАЧЕ ЦеныМатериаловСрезПоследних.Цена = ВТ.ЦенаПотолок
		|			КОНЕЦ)
		|ГДЕ
		|	ЦеныМатериаловСрезПоследних.ЦветФактуры <> ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Фактура,
		|	ВТ.ТипФактуры,
		|	ЦеныМатериаловСрезПоследних.ЦветФактуры.Наименование,
		|	ВТ.ЦенаОтрез,
		|	ВТ.ЦенаПотолок";
	
    Запрос.УстановитьПараметр("ВТ", Т);
	Запрос.УстановитьПараметр("Валюта", ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение);
	Запрос.УстановитьПараметр("Отрез",ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение);
	Запрос.УстановитьПараметр("ВидЦен",ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2].Значение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТаблицуШиринФактур(Т)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ.Фактура КАК Фактура,
		|	ВТ.ЦенаОтрез КАК ЦенаОтрез,
		|	ВТ.ЦенаПотолок КАК ЦенаПотолок,
		|	ВТ.ТипФактуры КАК ТипФактуры
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Фактура КАК Фактура,
		|	ВТ.ТипФактуры КАК ТипФактуры,
		|	ВТ.ЦенаОтрез КАК ЦенаОтрез,
		|	ВТ.ЦенаПотолок КАК ЦенаПотолок,
		|	ЦеныМатериаловСрезПоследних.Фактура.ШиринаПолотна КАК ШиринаПолотна
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
		|				,
		|				Валюта = &Валюта
		|					И ВидЦен = &ВидЦен) КАК ЦеныМатериаловСрезПоследних
		|		ПО (ЦеныМатериаловСрезПоследних.Фактура.Родитель = ВТ.Фактура)
		|			И (ЦеныМатериаловСрезПоследних.Фактура.ТипФактуры = ВТ.ТипФактуры)
		|			И (ВЫБОР
		|				КОГДА ЦеныМатериаловСрезПоследних.ВидНоменклатуры = &Отрез
		|					ТОГДА ЦеныМатериаловСрезПоследних.Цена = ВТ.ЦенаОтрез
		|				ИНАЧЕ ЦеныМатериаловСрезПоследних.Цена = ВТ.ЦенаПотолок
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.Фактура,
		|	ВТ.ТипФактуры,
		|	ВТ.ЦенаОтрез,
		|	ВТ.ЦенаПотолок,
		|	ЦеныМатериаловСрезПоследних.Фактура.ШиринаПолотна";
	
    Запрос.УстановитьПараметр("ВТ", Т);
	Запрос.УстановитьПараметр("Валюта", ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение);
	Запрос.УстановитьПараметр("Отрез",ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение);
	Запрос.УстановитьПараметр("ВидЦен",ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2].Значение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьОтчет() Экспорт
	
	ПрайсЛистПолотна = ЭтотОбъект;
	СхемаКомпоновкиДанных = ПрайсЛистПолотна.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	// получаем сохранённые настройки, если они есть
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПрайсЛиста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиПрайсЛиста КАК НастройкиПрайсЛиста
		|ГДЕ
		|	НастройкиПрайсЛиста.СтраницаПрайсЛиста = ЗНАЧЕНИЕ(Справочник.СтраницыПрайсЛиста.Полотна)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Настройки = ВыборкаДетальныеЗаписи.Ссылка.Настройки.Получить();
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ТипЗнч(Настройки) <> Тип("НастройкиКомпоновкиДанных") Тогда
		//Из схемы возьмем настройки по умолчанию
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ИмяВарианта)  Тогда
	//	Настройки=СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВарианта].Настройки;
	//КонецЕсли;  

	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрПериод.Значение = ТекущаяДата();
	ПараметрПериод.Использование = Истина;
	
	//Результат = Новый ТабличныйДокумент;
	//ПрайсЛистПолотна.СформироватьОтчет(Результат);

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	                                    Настройки, ДанныеРасшифровки);
										
    УстановитьПривилегированныйРежим(Истина);
	
	тТаблица = ПолучитьТаблицу();


	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, Новый Структура("Т", тТаблица),
	                                               ДанныеРасшифровки, Истина);

	//Очищаем поле табличного документа
	Результат = Новый ТабличныйДокумент;

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат;
	
КонецФункции
